gw826943555/hal_gigadevice/gd32f527/standard_peripheral/include/gd32f527_syscfg.h
/* SYSCFG_STAT bits definitions */
#define SYSCFG_STAT_ECCMEIF0                BIT(0)                   /*!< SRAM0 two bits no-correction event flag */
#define SYSCFG_STAT_ECCSEIF0                BIT(1)                   /*!< SRAM0 single bit correction event flag */
#define SYSCFG_STAT_ECCMEIF1                BIT(2)                   /*!< SRAM1 two bits no-correction event flag */
#define SYSCFG_STAT_ECCSEIF1                BIT(3)                   /*!< SRAM1 single bit correction event flag */
#define SYSCFG_STAT_ECCMEIF2                BIT(4)                   /*!< SRAM2 two bits no-correction event flag */
#define SYSCFG_STAT_ECCSEIF2                BIT(5)                   /*!< SRAM2 single bit correction event flag */
#define SYSCFG_STAT_ECCMEIF3                BIT(6)                   /*!< ADDSRAM two bits no-correction event flag */
#define SYSCFG_STAT_ECCSEIF3                BIT(7)                   /*!< ADDSRAM single bit correction event flag */
#define SYSCFG_STAT_ECCMEIF4                BIT(8)                   /*!< TCMSRAM two bits no-correction event flag */
#define SYSCFG_STAT_ECCSEIF4                BIT(9)                   /*!< TCMSRAM single bit correction event flag */
#define SYSCFG_STAT_ECCMEIF5                BIT(10)                  /*!< BKPSRAM two bits no-correction event flag */
#define SYSCFG_STAT_ECCSEIF5                BIT(11)                  /*!< BKPSRAM single bit correction event flag */
#define SYSCFG_STAT_ECCMEIF6                BIT(12)                  /*!< FLASH two bits no-correction event flag */
#define SYSCFG_STAT_ECCSEIF6                BIT(13)                  /*!< FLASH single bit correction event flag */
#define SYSCFG_STAT_CKMNMIIF                BIT(14)                  /*!< HXTAL clock moniotor NMI interrupt flag */

/* SYSCFG_SRAM0ECC bits definitions */
#define SYSCFG_SRAM0ECC_ECCMEIE0            BIT(0)                   /*!< SRAM0 two bits non-correction interrupt enable */
#define SYSCFG_SRAM0ECC_ECCSEIE0            BIT(1)                   /*!< SRAM0 single bit correction interrupt enable */
#define SYSCFG_SRAM0ECC_CKMNMIIE            BIT(2)                   /*!< HXTAL clock moniotor NMI interrupt enable */
#define SYSCFG_SRAM0ECC_ECCSERRBITS0        BITS(10,15)              /*!< indicates the error bit */
#define SYSCFG_SRAM0ECC_ECCEADDR0           BITS(16,31)              /*!< indicates the last address ECC event on SRAM0 occurred */
                                            
/* SYSCFG_SRAM1ECC bits definitions */      
#define SYSCFG_SRAM1ECC_ECCMEIE1            BIT(0)                   /*!< SRAM1 two bits non-correction interrupt enable */
#define SYSCFG_SRAM1ECC_ECCSEIE1            BIT(1)                   /*!< SRAM1 single bit correction interrupt enable */
#define SYSCFG_SRAM1ECC_ECCSERRBITS1        BITS(12,17)              /*!< indicates the error bit */
#define SYSCFG_SRAM1ECC_ECCEADDR1           BITS(18,31)              /*!< indicates the last address ECC event on SRAM1 occurred */
                                            
/* SYSCFG_SRAM2ECC bits definitions */      
#define SYSCFG_SRAM2ECC_ECCMEIE2            BIT(0)                   /*!< SRAM2 two bits non-correction interrupt enable */
#define SYSCFG_SRAM2ECC_ECCSEIE2            BIT(1)                   /*!< SRAM2 single bit correction interrupt enable */
#define SYSCFG_SRAM2ECC_ECCSERRBITS2        BITS(10,15)              /*!< indicates the error bit */
#define SYSCFG_SRAM2ECC_ECCEADDR2           BITS(16,31)              /*!< indicates the last address ECC event on SRAM2 occurred */

/* SYSCFG_ADDSRAMECC bits definitions */
#define SYSCFG_ADDSRAMECC_ECCMEIE3          BIT(0)                   /*!< ADDSRAM two bits non-correction interrupt enable */
#define SYSCFG_ADDSRAMECC_ECCSEIE3          BIT(1)                   /*!< ADDSRAM single bit correction interrupt enable */
#define SYSCFG_ADDSRAMECC_ECCSERRBITS3      BITS(8,13)               /*!< indicates the error bit */
#define SYSCFG_ADDSRAMECC_ECCEADDR3         BITS(14,31)              /*!< indicates the last address ECC event on ADDSRAM occurred */
                                                                
/* SYSCFG_TCMSRAMECC bits definitions */                        
#define SYSCFG_TCMSRAMECC_ECCMEIE4          BIT(0)                   /*!< TCMSRAM two bits non-correction interrupt enable */
#define SYSCFG_TCMSRAMECC_ECCSEIE4          BIT(1)                   /*!< TCMSRAM single bit correction interrupt enable */
#define SYSCFG_TCMSRAMECC_ECCSERRBITS4      BITS(12,17)              /*!< indicates the error bit */
#define SYSCFG_TCMSRAMECC_ECCEADDR4         BITS(18,31)              /*!< indicates the last address ECC event on TCMSRAM occurred */
                                                                
/* SYSCFG_BKPSRAMECC bits definitions */                        
#define SYSCFG_BKPSRAMECC_ECCMEIE5          BIT(0)                   /*!< BKPSRAM two bits non-correction interrupt enable */
#define SYSCFG_BKPSRAMECC_ECCSEIE5          BIT(1)                   /*!< BKPSRAM single bit correction interrupt enable */
#define SYSCFG_BKPSRAMECC_ECCSERRBITS5      BITS(16,21)              /*!< indicates the error bit */
#define SYSCFG_BKPSRAMECC_ECCEADDR5         BITS(22,31)              /*!< indicates the last address ECC event on BKPSRAM occurred */
                                                                
/* SYSCFG_FLASHECC_ADDR */                                      
#define SYSCFG_FLASHECC_ADDR_ECCEADDR6      BITS(0,31)               /*!< indicates the last address of ECC event on FLASH occurred */

/* SYSCFG_FLASHECC bits definitions */
#define SYSCFG_FLASHECC_ECCMEIE6            BIT(0)                   /*!< FLASH two bits non-correction interrupt enable */
#define SYSCFG_FLASHECC_ECCSEIE6            BIT(1)                   /*!< FLASH single bit correction interrupt enable */
#define SYSCFG_FLASHECC_ECCSERRBITS6        BITS(2,7)                /*!< indicates the error bit */

/* USER_CFG bits definitions */
#define USER_CFG_ANA_VERSION                BITS(24,31)              /*!< analog version information */

/* constants definitions */
/* boot mode definitions */
#define SYSCFG_BOOTMODE_FLASH               ((uint8_t)0x00U)         /*!< main flash memory remap */
#define SYSCFG_BOOTMODE_BOOTLOADER          ((uint8_t)0x01U)         /*!< boot loader remap */
#define SYSCFG_BOOTMODE_SRAM                ((uint8_t)0x03U)         /*!< SRAM0 of on-chip SRAM remap */
#define SYSCFG_BOOTMODE_OTP                 ((uint8_t)0x05U)         /*!< OTP remap */

/* FMC swap definitions */
#define SYSCFG_FMC_SWP_BANK0                ((uint32_t)0x00000000U)  /*!< main flash Bank 0 is mapped at address 0x08000000 */
#define SYSCFG_FMC_SWP_BANK1                ((uint32_t)0x00000100U)  /*!< main flash Bank 1 is mapped at address 0x08000000 */

/* EXMC swap enable/disable */
#define SYSCFG_EXMC_SWP_ENABLE              ((uint32_t)0x00000400U)  /*!< SDRAM bank 0 and bank 1 are swapped with NAND bank 1 and PC card */
#define SYSCFG_EXMC_SWP_DISABLE             ((uint32_t)0x00000000U)  /*!< no memory mapping swap */

