gw826943555/hal_gigadevice/gd32f527/standard_peripheral/include/gd32f527_syscfg.h
/* SYSCFG interrupt enable or disable */
typedef enum
{
    SYSCFG_INT_ECCME0                       = SYSCFG_REGIDX_BIT(SRAM0ECC_REG_OFFSET, 0U),      /*!< SRAM0 two bits non-correction interrupt */
    SYSCFG_INT_ECCSE0                       = SYSCFG_REGIDX_BIT(SRAM0ECC_REG_OFFSET, 1U),      /*!< SRAM0 single bit correction interrupt */
    SYSCFG_INT_CKMNMI                       = SYSCFG_REGIDX_BIT(SRAM0ECC_REG_OFFSET, 2U),      /*!< HXTAL clock moniotor NMI interrupt */
    SYSCFG_INT_ECCME1                       = SYSCFG_REGIDX_BIT(SRAM1ECC_REG_OFFSET, 0U),      /*!< SRAM1 two bits non-correction interrupt */
    SYSCFG_INT_ECCSE1                       = SYSCFG_REGIDX_BIT(SRAM1ECC_REG_OFFSET, 1U),      /*!< SRAM1 single bit correction interrupt */
    SYSCFG_INT_ECCME2                       = SYSCFG_REGIDX_BIT(SRAM2ECC_REG_OFFSET, 0U),      /*!< SRAM2 two bits non-correction interrupt */
    SYSCFG_INT_ECCSE2                       = SYSCFG_REGIDX_BIT(SRAM2ECC_REG_OFFSET, 1U),      /*!< SRAM2 single bit correction interrupt */
    SYSCFG_INT_ECCME3                       = SYSCFG_REGIDX_BIT(ADDSRAMECC_REG_OFFSET, 0U),    /*!< ADDSRAM two bits non-correction interrupt */
    SYSCFG_INT_ECCSE3                       = SYSCFG_REGIDX_BIT(ADDSRAMECC_REG_OFFSET, 1U),    /*!< ADDSRAM single bit correction interrupt */
    SYSCFG_INT_ECCME4                       = SYSCFG_REGIDX_BIT(TCMSRAMECC_REG_OFFSET, 0U),    /*!< TCMSRAM two bits non-correction interrupt */
    SYSCFG_INT_ECCSE4                       = SYSCFG_REGIDX_BIT(TCMSRAMECC_REG_OFFSET, 1U),    /*!< TCMSRAM single bit correction interrupt */
    SYSCFG_INT_ECCME5                       = SYSCFG_REGIDX_BIT(BKPSRAMECC_REG_OFFSET, 0U),    /*!< BKPSRAM two bits non-correction interrupt */
    SYSCFG_INT_ECCSE5                       = SYSCFG_REGIDX_BIT(BKPSRAMECC_REG_OFFSET, 1U),    /*!< BKPSRAM single bit correction interrupt */
    SYSCFG_INT_ECCME6                       = SYSCFG_REGIDX_BIT(FLASHECC_REG_OFFSET, 0U),      /*!< FLASH two bits non-correction interrupt */
    SYSCFG_INT_ECCSE6                       = SYSCFG_REGIDX_BIT(FLASHECC_REG_OFFSET, 1U)       /*!< FLASH single bit correction interrupt */
} syscfg_interrupt_enum;

/* SYSCFG flags */
typedef enum
{
    SYSCFG_FLAG_ECCME0                      = SYSCFG_STAT_ECCMEIF0,   /*!< SRAM0 two bits non-correction event flag */
    SYSCFG_FLAG_ECCSE0                      = SYSCFG_STAT_ECCSEIF0,   /*!< SRAM0 single bit correction event flag */
    SYSCFG_FLAG_ECCME1                      = SYSCFG_STAT_ECCMEIF1,   /*!< SRAM1 two bits non-correction event flag */
    SYSCFG_FLAG_ECCSE1                      = SYSCFG_STAT_ECCSEIF1,   /*!< SRAM1 single bit correction event flag */
    SYSCFG_FLAG_ECCME2                      = SYSCFG_STAT_ECCMEIF2,   /*!< SRAM2 two bits non-correction event flag */
    SYSCFG_FLAG_ECCSE2                      = SYSCFG_STAT_ECCSEIF2,   /*!< SRAM2 single bit correction event flag */
    SYSCFG_FLAG_ECCME3                      = SYSCFG_STAT_ECCMEIF3,   /*!< ADDSRAM two bits non-correction event flag */
    SYSCFG_FLAG_ECCSE3                      = SYSCFG_STAT_ECCSEIF3,   /*!< ADDSRAM single bit correction event flag */
    SYSCFG_FLAG_ECCME4                      = SYSCFG_STAT_ECCMEIF4,   /*!< TCMSRAM two bits non-correction event flag */
    SYSCFG_FLAG_ECCSE4                      = SYSCFG_STAT_ECCSEIF4,   /*!< TCMSRAM single bit correction event flag */
    SYSCFG_FLAG_ECCME5                      = SYSCFG_STAT_ECCMEIF5,   /*!< BKPSRAM two bits non-correction event flag */
    SYSCFG_FLAG_ECCSE5                      = SYSCFG_STAT_ECCSEIF5,   /*!< BKPSRAM single bit correction event flag */
    SYSCFG_FLAG_ECCME6                      = SYSCFG_STAT_ECCMEIF6,   /*!< FLASH two bits non-correction event flag */
    SYSCFG_FLAG_ECCSE6                      = SYSCFG_STAT_ECCSEIF6,   /*!< FLASH single bit correction event flag */    
    SYSCFG_FLAG_CKMNMI                      = SYSCFG_STAT_CKMNMIIF    /*!< HXTAL clock moniotor NMI flag */    
} syscfg_flag_enum;

/* SYSCFG interrupt flags */
typedef enum
{
    SYSCFG_INT_FLAG_ECCME0                  = SYSCFG_STAT_ECCMEIF0,   /*!< SRAM0 two bits non-correction event interrupt flag */
    SYSCFG_INT_FLAG_ECCSE0                  = SYSCFG_STAT_ECCSEIF0,   /*!< SRAM0 single bit correction event interrupt flag */
    SYSCFG_INT_FLAG_ECCME1                  = SYSCFG_STAT_ECCMEIF1,   /*!< SRAM1 two bits non-correction event interrupt flag */
    SYSCFG_INT_FLAG_ECCSE1                  = SYSCFG_STAT_ECCSEIF1,   /*!< SRAM1 single bit correction event interrupt flag */
    SYSCFG_INT_FLAG_ECCME2                  = SYSCFG_STAT_ECCMEIF2,   /*!< SRAM2 two bits non-correction event interrupt flag */
    SYSCFG_INT_FLAG_ECCSE2                  = SYSCFG_STAT_ECCSEIF2,   /*!< SRAM2 single bit correction event interrupt flag */
    SYSCFG_INT_FLAG_ECCME3                  = SYSCFG_STAT_ECCMEIF3,   /*!< ADDSRAM two bits non-correction event interrupt flag */
    SYSCFG_INT_FLAG_ECCSE3                  = SYSCFG_STAT_ECCSEIF3,   /*!< ADDSRAM single bit correction event interrupt flag */
    SYSCFG_INT_FLAG_ECCME4                  = SYSCFG_STAT_ECCMEIF4,   /*!< TCMSRAM two bits non-correction event interrupt flag */
    SYSCFG_INT_FLAG_ECCSE4                  = SYSCFG_STAT_ECCSEIF4,   /*!< TCMSRAM single bit correction event interrupt flag */
    SYSCFG_INT_FLAG_ECCME5                  = SYSCFG_STAT_ECCMEIF5,   /*!< BKPSRAM two bits non-correction event interrupt flag */
    SYSCFG_INT_FLAG_ECCSE5                  = SYSCFG_STAT_ECCSEIF5,   /*!< BKPSRAM single bit correction event interrupt flag */
    SYSCFG_INT_FLAG_ECCME6                  = SYSCFG_STAT_ECCMEIF6,   /*!< FLASH two bits non-correction event interrupt flag */
    SYSCFG_INT_FLAG_ECCSE6                  = SYSCFG_STAT_ECCSEIF6,   /*!< FLASH single bit correction event interrupt flag */    
    SYSCFG_INT_FLAG_CKMNMI                  = SYSCFG_STAT_CKMNMIIF    /*!< HXTAL clock moniotor NMI interrupt flag */    
} syscfg_interrupt_flag_enum;

/* function declarations */
/* initialization functions */
/* deinit syscfg module */
void syscfg_deinit(void);

